<?php

require_once( __DIR__ . '/../../../maintenance/Maintenance.php' );

class ApproveAllPages extends Maintenance {
	
	public function __construct() {
		parent::__construct();
		
		$this->mDescription = "Assign pages to projects and approve some of them.";
	}
	
	public function execute() {

		$entries = array(
			array( 'title' => 'אביב לניצולי השואה',  'org' => 'אביב לניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'זכאות לטיפול רפואי במחלות המוכרות לניצולי שואה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'דמי נסיעה ודמי ניידות לנכי המלחמה בנאצים',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'האגף לסיוע משפטי במשרד המשפטים- ייצוג ניצולי שואה',  'org' => 'האגף לסיוע משפטי - משרד המשפטים', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'סיוע במיצוי זכויות לניצולי שואה מטעם עמותת "יש"',  'org' => 'עמותת יש', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'יש - ילדים ויתומים ניצולי שואה בישראל',  'org' => 'עמותת יש', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'אופן היישום של תקנה 12 לתקנות נכי רדיפות הנאצים',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'החזר הוצאות נסיעה לטיפולים במחלות המוכרות לניצולי שואה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'אי זכאותו של מי שאינו אזרח ישראל לקצבה מהאוצר גם אם עבר רדיפה מוכרת ועלה לפני 1953',  'org' => 'כל-זכות', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'ארגון יוצאי מרכז אירופה',  'org' => 'ארגון יוצאי מרכז אירופה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'גיל הינו שיקול ביחס לתקנה 12 לתקנות נכי רדיפות הנאצים (קביעת דרגת נכות) אף למי שהיה ילד בשואה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '27.02.2013', 'on_behalf' => 'שרה שהם' ),
			array( 'title' => 'הכרה בסיבוכים מאוחרים של יתר לחץ דם לניצולי שואה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '17.02.2013', 'on_behalf' => 'ד"ר משה ברוך' ),
			array( 'title' => 'דוגמא לדו"ח סוציאלי להעלאת אחוזי נכות לניצולי שואה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'דחיית ערר של יוצא גרמניה שזכאותו לקצבה נדחתה מכיוון שויתר על קצבתו בעבר',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'ניצול שואה יוכר כזכאי לתגמול לפי הכנסה גם אם הוא עובד לפרנסתו',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '27.02.2013', 'on_behalf' => 'שרה שהם' ),
			array( 'title' => 'דחיית תובענה להכרה לפי הלכת הפחד והלכת האלימות העקיפה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'דמי הבראה לניצולי שואה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'השבת רכוש לאזרחי ישראל שהיו בעלי רכוש בסרביה',  'org' => 'המשרד לאזרחים ותיקים (המשרד לענייני גמלאים)', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'דמי נסיעה ודמי ניידות לניצולי שואה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'הבראה לניצולי שואה בעלי זכויות ריפוי מגרמניה',  'org' => 'הלשכה לענייני פיצויים אישיים מחו"ל', 'date' => '19.12.2012', 'on_behalf' => 'חנה פלור' ),
			array( 'title' => 'ניצולי שואה המוכרים על ידי רשויות הפיצויים בגרמניה בגין נזקי בריאות (BEG)',  'org' => 'הלשכה לענייני פיצויים אישיים מחו"ל', 'date' => '09.01.2013', 'on_behalf' => 'חנה פלור' ),
			array( 'title' => 'החזר הוצאות רפואיות לניצולי שואה מרשות הפיצויים הגרמנית',  'org' => 'הלשכה לענייני פיצויים אישיים מחו"ל', 'date' => '19.12.2012', 'on_behalf' => 'חנה פלור ' ),
			array( 'title' => 'החזר/פטור מהוצאות רפואיות במחלות המוכרות מקופות החולים כללית ומכבי',  'org' => 'הלשכה לענייני פיצויים אישיים מחו"ל', 'date' => '19.12.2012', 'on_behalf' => 'חנה פלור ' ),
			array( 'title' => 'הגבלת שכר עורך דין בתביעות מכוח חוק ההטבות לניצולי שואה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '10.02.2013', 'on_behalf' => 'רוית ליברמן' ),
			array( 'title' => 'תגמול לשאירים של ניצולי שואה המקבלים תגמול ממשרד האוצר',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '10.02.2013', 'on_behalf' => 'רוית ליברמן' ),
			array( 'title' => 'מכתב החמרה במצב הרפואי לניצולי שואה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'הגבלת שכר עורך דין בתביעות של ניצולי שואה לפי חוק נכי רדיפות הנאצים',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '10.02.2013', 'on_behalf' => 'רוית ליברמן ' ),
			array( 'title' => 'הגדלת קצבת גמלאי צה"ל לניצולי שואה',  'org' => 'כל-זכות', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'הגדלת קצבת גמלאי רשויות מקומיות לניצולי שואה',  'org' => 'כל-זכות', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'הגדלת קצבת גמלאי שירות המדינה לניצולי שואה',  'org' => 'כל-זכות', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'החזר חלקי של מס קניה ומע"מ ברכישת מוצרים חשמליים לניצולי שואה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '04.03.2013', 'on_behalf' => 'יהודית חי' ),
			array( 'title' => 'החמרה במצב רפואי לניצולי שואה שהוכרו על ידי רשויות הפיצויים בגרמניה כמי שנפגעו בריאותית בשואה',  'org' => 'הלשכה לענייני פיצויים אישיים מחו"ל', 'date' => '09.01.2013', 'on_behalf' => 'חנה פלור' ),
			array( 'title' => 'החזר הוצאות סיעוד לניצולי שואה המקבלים רנטה בריאותית מגרמניה',  'org' => 'הלשכה לענייני פיצויים אישיים מחו"ל', 'date' => '05.12.2012', 'on_behalf' => 'חנה פלור' ),
			array( 'title' => 'החמרה במצב רפואי של ניצולי שואה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '30.01.2013', 'on_behalf' => 'טובה זלצר' ),
			array( 'title' => 'הטבות מטעם הקרן לניצולי שואה יוצאי אוסטריה',  'org' => 'הקרן לניצולי שואה יוצאי אוסטריה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'הכרה ביתר לחץ דם, סכרת ומחלות לב לניצולי שואה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '17.02.2013', 'on_behalf' => 'ד"ר משה ברוך ' ),
			array( 'title' => 'מכתב הכרה בשיטיון (דמנציה) כמחלה נוספת לניצולי שואה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '17.02.2013', 'on_behalf' => 'ד"ר משה ברוך ' ),
			array( 'title' => 'הכרה במחלות עור לניצולי שואה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '17.02.2013', 'on_behalf' => 'ד"ר משה ברוך ' ),
			array( 'title' => 'הכרה במחלות פרקים ועמוד השדרה לניצולי שואה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '17.02.2013', 'on_behalf' => 'ד"ר משה ברוך' ),
			array( 'title' => 'הכרה במחלת האוסטאופורוזיס לניצולי שואה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '17.02.2013', 'on_behalf' => 'ד"ר משה ברוך' ),
			array( 'title' => 'הכרה במחלת הסרטן לניצולי שואה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '17.02.2013', 'on_behalf' => 'ד"ר משה ברוך ' ),
			array( 'title' => 'הכרה בשיטיון (דמנציה) לניצולי שואה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '17.02.2013', 'on_behalf' => 'ד"ר משה ברוך' ),
			array( 'title' => 'הכרה ביהודי לוב לפי חוק נכי רדיפות הנאצים',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '10.02.2013', 'on_behalf' => 'רוית ליברמן ' ),
			array( 'title' => 'הכרה כזכאי לתגמול לפי הכנסה/תגמול מוגדל לפי הכנסה לניצולי שואה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '04.03.2013', 'on_behalf' => 'יהודית חי' ),
			array( 'title' => 'מתגמול לפי הכנסה/תגמול מוגדל לפי הכנסה יש לקזז את גמלת הביטוח הלאומי "ברוטו"',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '27.02.2013', 'on_behalf' => 'שרה שהם' ),
			array( 'title' => 'הכרה כניצול למי שהיה עובר ברחם אימו בעת הרדיפות',  'org' => 'כל-זכות', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'הכרה רטרואקטיבית בהוצאות אישפוז לניצולי שואה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'הלוואות לניצולי שואה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '04.03.2013', 'on_behalf' => 'יהודית חי' ),
			array( 'title' => 'הלשכה לענייני פיצויים אישיים מחו"ל',  'org' => 'הלשכה לענייני פיצויים אישיים מחו"ל', 'date' => '19.12.2012', 'on_behalf' => 'חנה פלור' ),
			array( 'title' => 'המועד הנכון לאישור תביעה לקצבה של ניצול שואה אזרח אוקראינה שתביעתו נדחתה בעבר',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'המרת קצבת ניצולי שואה בסכום חד פעמי לצורך שיקום',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '10.02.2013', 'on_behalf' => 'רוית ליברמן' ),
			array( 'title' => 'המשרד לאזרחים ותיקים (המשרד לענייני גמלאים)',  'org' => 'המשרד לאזרחים ותיקים', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'הנחה בארנונה לניצולי שואה',  'org' => 'כל-זכות', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'הנחה בחשבון חשמל לניצולי שואה נזקקים/נצרכים',  'org' => 'כל-זכות', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'הנחה בקניית תרופות לניצולי שואה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'הנחה בתשלום מס רכישה עבור דירה לניצולי שואה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '04.03.2013', 'on_behalf' => 'יהודית חי' ),
			array( 'title' => 'הפרויקט הלאומי לסיוע לניצולי שואה - בשיתוף התאחדות הסטודנטים והמשרד לאזרחים ותיקים',  'org' => 'המשרד לאזרחים ותיקים', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'הקליניקה לזכויות ניצולי השואה באוניברסיטת תל אביב',  'org' => 'הקליניקה לסיוע משפטי לקשישים וניצולי שואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'הקליניקה לסיוע לניצולי שואה במרכז הבינתחומי בשיתוף הקרן לרווחה לנפגעי שואה בישראל',  'org' => 'הקרן לרווחה לנפגעי השואה', 'date' => '06.01.2013', 'on_behalf' => 'יניב קומיסיונרו ' ),
			array( 'title' => 'החזר הוצאות נסיעה באמבולנס מאת הקרן לרווחה לנפגעי השואה',  'org' => 'הקרן לרווחה לנפגעי השואה', 'date' => '17.02.2013', 'on_behalf' => 'יניב קומיסיונרו ' ),
			array( 'title' => 'מועדוני בריטניה - מועדונים חברתיים לניצולי השואה בישראל',  'org' => 'הקרן לרווחה לנפגעי השואה', 'date' => '17.02.2013', 'on_behalf' => 'יניב קומיסיונרו ' ),
			array( 'title' => 'הקליניקה לסיוע משפטי לקשישים וניצולי שואה - הפקולטה למשפטים - אוניברסיטת בר אילן',  'org' => 'הקליניקה לסיוע משפטי לקשישים וניצולי שואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'הקרן לרווחה לנפגעי השואה בישראל',  'org' => 'הקרן לרווחה לנפגעי השואה בישראל', 'date' => '30.12.2012', 'on_behalf' => 'יניב קומיסיונרו' ),
			array( 'title' => 'פעילות התנדבותית לניצולי שואה מטעם הקרן לרווחה לנפגעי השואה',  'org' => 'הקרן לרווחה לנפגעי השואה בישראל', 'date' => '30.12.2012', 'on_behalf' => 'יניב קומיסיונרו' ),
			array( 'title' => 'בדיקות ראייה ומתן משקפים בחינם/בעלות מופחתת לניצולי שואה',  'org' => 'הקרן לרווחה לנפגעי השואה בישראל', 'date' => '06.01.2013', 'on_behalf' => 'יניב קומיסיונרו' ),
			array( 'title' => 'סיוע לניצולי שואה מהקרן לרווחה לנפגעי השואה בישראל',  'org' => 'הקרן לרווחה לנפגעי השואה בישראל', 'date' => '30.12.2012', 'on_behalf' => 'יניב קומיסיונרו' ),
			array( 'title' => 'עזרה סיעודית לניצולי שואה לאחר אשפוז מהקרן לרווחה לנפגעי השואה בישראל (סול"ם)',  'org' => 'הקרן לרווחה לנפגעי השואה בישראל', 'date' => '06.01.2013', 'on_behalf' => 'יניב קומיסיונרו' ),
			array( 'title' => 'הרשות לזכויות ניצולי השואה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'ועדת שני (ניצולי שואה)',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '17.02.2013', 'on_behalf' => 'ד"ר משה ברוך' ),
			array( 'title' => 'ועידת התביעות',  'org' => 'ועידת התביעות', 'date' => '27.01.2013', 'on_behalf' => 'אודי מוזס' ),
			array( 'title' => 'חוק התביעות של קרבנות השואה (הסדר הטיפול)',  'org' => 'ועידת התביעות', 'date' => '27.01.2013', 'on_behalf' => 'אודי מוזס' ),
			array( 'title' => 'הגבלת שכר טרחה עבור טיפול בתביעות של ניצולי שואה המוגשות בחו"ל',  'org' => 'ועידת התביעות', 'date' => '27.01.2013', 'on_behalf' => 'אודי מוזס' ),
			array( 'title' => 'זכאות יורשיהם של ניצולי שואה מלוב לקצבה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'זכאות יורשים לקצבה לפי חוק נכי רדיפות הנאצים',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '10.02.2013', 'on_behalf' => 'רוית ליברמן' ),
			array( 'title' => 'זכאות לקצבה לפי חוק נכי רדיפות הנאצים ליהודי רומניה ובולגריה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '10.02.2013', 'on_behalf' => 'רוית ליברמן ' ),
			array( 'title' => 'זכאות לקצבה עקב בריחה מרומניה, בולגריה או הונגריה מפחד רדיפות הנאצים לפני ה-6.4.1941',  'org' => 'כל-זכות', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'זכאות לקצבה של ניצולי שואה בעלי אזרחות מערב אירופאית',  'org' => 'כל-זכות', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'זכאותם של ילדי טהרן לפיצוי ממדינת ישראל עקב הסכם השילומים',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '27.02.2013', 'on_behalf' => 'רוית ליברמן' ),
			array( 'title' => 'זכויות ניצולי שואה',  'org' => 'הרשות לזכויות לניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'זכויות ניצולי שואה/ארגוני סיוע',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'זכויות ניצולי שואה/שאלות נפוצות',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'זכויות ניצולי שואה/תקדימים משפטיים',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'חובת הנמקה של הוועדה הרפואית העליונה לפי חוק נכי רדיפות הנאצים',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '27.02.2013', 'on_behalf' => 'שרה שהם' ),
			array( 'title' => 'חוק ההסדרים 2001- תיקון לחוק נכי רדיפות הנאצים',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '10.02.2013', 'on_behalf' => 'רוית ליברמן' ),
			array( 'title' => 'חוק הטבות לניצולי שואה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '10.02.2013', 'on_behalf' => 'רוית ליברמן ' ),
			array( 'title' => 'חוק זכרון השואה והגבורה - יד ושם',  'org' => 'יד ושם', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'חוק נכי המלחמה בנאצים',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '10.02.2013', 'on_behalf' => 'רוית ליברמן' ),
			array( 'title' => 'חוק נכי רדיפות הנאצים',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '10.02.2013', 'on_behalf' => 'רוית ליברמן ' ),
			array( 'title' => 'טיפול סוציאלי פרטני לניצולי שואה מטעם הקרן לרווחה',  'org' => 'הקרן לרווחה לנפגעי השואה בישראל', 'date' => '06.01.2013', 'on_behalf' => 'יניב קומיסיונרו ' ),
			array( 'title' => 'טיפולי שיניים לניצולי שואה מהקרן לרווחה לנפגעי השואה בישראל',  'org' => 'הקרן לרווחה לנפגעי השואה בישראל', 'date' => '06.01.2013', 'on_behalf' => 'יניב קומיסיונרו ' ),
			array( 'title' => 'טיפולי שיניים מסובסדים לניצולי שואה בארגון יד שרה',  'org' => 'יד שרה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'יהודי לוב זכאים להכרה לפי חוק נכי רדיפות הנאצים',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'יהודים ששהו בעוצר חלקי ברומניה ובולגריה זכאים לפיצוי מכוח חוק נכי רדיפות הנאצים',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'יוצא לוב שזכאי לקצבה לפי ההחלטה המנהלית לא זכאי לקצבה בגין עילה נוספת',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'יורשיו של ניצול שנפטר לאחר הגשת תביעה זכאים לתגמול עד לפטירה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'ילדות אבודה',  'org' => 'ילדות אבודה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'לא הוכח שמחלת האוסטאואתריטיס קשורה לרדיפות הנאצים',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '27.02.2013', 'on_behalf' => 'שרה שהם' ),
			array( 'title' => 'לא ניתן להכיר בטכיקרדיה או ב"רשרוש בלב" כמחלות הקשורות לרדיפות הנאצים',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '27.02.2013', 'on_behalf' => 'שרה שהם ' ),
			array( 'title' => 'לחצני מצוקה לניצולי שואה מהקרן לרווחה לנפגעי השואה בישראל',  'org' => 'הקרן לרווחה לנפגעי השואה בישראל', 'date' => '06.01.2013', 'on_behalf' => 'יניב קומיסיונרו' ),
			array( 'title' => 'מימון הוצאות פינוי באמבולנס לניצולי שואה',  'org' => 'מד"א', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'מכתב אישי לועדה רפואית - החמרה במצב של ניצול שואה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'מכתב בקשה להבטחת הכנסה למקבלי קצבת יוצאי מחנות וגטאות',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'מכתב הודעה על קבלת תשלום מקרן סעיף 2 לניצולי שואה שאינו נחשב כהכנסה',  'org' => 'ועידת התביעות', 'date' => '27.01.2013', 'on_behalf' => 'אודי מוזס' ),
			array( 'title' => 'מענק השכלה לבני/בנות ניצולי שואה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '04.03.2013', 'on_behalf' => 'יהודית חי' ),
			array( 'title' => 'מענק חד פעמי ליהודים שחיו תחת הגבלות תנועה במשטר וישי במרוקו',  'org' => 'ועידת התביעות', 'date' => '26.12.2012', 'on_behalf' => 'אודי מוזס ' ),
			array( 'title' => 'מענק חד פעמי ליהודים שחיו תחת הכיבוש הגרמני בתוניסיה',  'org' => 'ועידת התביעות', 'date' => '26.12.2012', 'on_behalf' => 'אודי מוזס' ),
			array( 'title' => 'מענק חד פעמי ליהודים שחיו תחת מגבלות חופש בבולגריה',  'org' => 'ועידת התביעות', 'date' => '26.12.2012', 'on_behalf' => 'אודי מוזס ' ),
			array( 'title' => 'מענק חד פעמי ליהודים שחיו תחת מגבלות חופש ברומניה',  'org' => 'ועידת התביעות', 'date' => '26.12.2012', 'on_behalf' => 'אודי מוזס ' ),
			array( 'title' => 'מענק חד פעמי לנרדפי הנאצים ממדינות מערב אירופה',  'org' => 'ועידת התביעות', 'date' => '26.12.2012', 'on_behalf' => 'אודי מוזס' ),
			array( 'title' => 'מענק חד פעמי לפליטים מאזורים בברה"מ שהיו בסכנת כיבוש נאצי ולא נכבשו',  'org' => 'ועידת התביעות', 'date' => '28.11.2012', 'on_behalf' => 'אודי מוזס ' ),
			array( 'title' => 'מענק חד פעמי מקרן הסיוע של ועידת התביעות',  'org' => 'ועידת התביעות', 'date' => '28.11.2012', 'on_behalf' => 'אודי מוזס' ),
			array( 'title' => 'מענק חד שנתי לניצולי שואה המקבלים הבטחת הכנסה מהביטוח הלאומי',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '10.02.2013', 'on_behalf' => 'רוית ליברמן' ),
			array( 'title' => 'מענק לניצולי שואה בעלי הכנסה נמוכה מהחברה להשבה',  'org' => 'החברה לאיתור ולהשבת נכסים של נספי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'מענק מס קניה ומע"מ לניצולי שואה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'מענק מצבה לניצולי שואה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '04.03.2013', 'on_behalf' => 'יהודית חי' ),
			array( 'title' => 'מענקים אישיים לניצולי שואה מהקרן לרווחה לנפגעי השואה בישראל',  'org' => 'הקרן לרווחה לנפגעי השואה בישראל', 'date' => '19.12.2012', 'on_behalf' => 'יניב קומיסיונרו' ),
			array( 'title' => 'מרכז הארגונים של ניצולי השואה',  'org' => 'מרכז הארגונים של ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'משקפי ראייה ללא עלות לניצולי שואה נזקקים',  'org' => 'הקרן לרווחה לנפגעי השואה בישראל', 'date' => '06.01.2013', 'on_behalf' => 'יניב קומיסיונרו' ),
			array( 'title' => 'מתגמול נזקק/נצרך יש לקזז את גמלת הביטוח הלאומי "ברוטו"',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'ניצול שואה יוכר כנזקק גם אם הוא עובד לפרנסתו',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'ניצול שואה ששמר על זיקה רציפה לישראל ועלה לישראל זכאי להכרה כנכה לפי חוק נכי רדיפות הנאצים',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'ניצול שעלה לארץ לאחר המועד הקובע בחוק בשל גיוסו לסוכנות זכאי לפיצוי',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'ניצולי שואה המקבלים קצבה (רנטה) בריאותית מממשלת גרמניה (BEG)',  'org' => 'הלשכה לענייני פיצויים אישיים מחו"ל', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'ניצולי שואה המקבלים תגמול ממשרד האוצר',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'ניצולי שואה המקבלים קצבה ליוצאי מחנות וגטאות ממשרד האוצר',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'ניצולי שואה המקבלים קצבה מקרן סעיף 2 של ועידת התביעות',  'org' => 'ועידת התביעות', 'date' => '27.01.2013', 'on_behalf' => 'אודי מוזס ' ),
			array( 'title' => 'ניצולי שואה שאינם מקבלים קצבה חודשית',  'org' => 'כל-זכות', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'ניצולי שואה שתביעתם לפיצויים מגרמניה נדחתה על הסף זכאים להגיש תביעה לפי חוק נכי רדיפות הנאצים',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'ניצולת שואה יוצאת תוניסיה זכאית לתשלום תגמול נזקק מיום הגשת התביעה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'ניצולת שואה שהייתה תושבת גרמניה לא זכאית לפיצוי לפי חוק נכי רדיפת הנאצים',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'ניצולת שואה שחיה תקופה ארוכה מחוץ לישראל זכאית להכרה כנכה לפי חוק רדיפות הנאצים',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'ניצולת שואה שנזק לחלק משיניה הוכר כקשור לרדיפות זכאית להכרה גם בנזק שנגרם ליתר השיניים',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '27.02.2013', 'on_behalf' => 'שרה שהם' ),
			array( 'title' => 'סבסוד במרכזי יום לניצולי שואה נזקקים',  'org' => 'ועידת התביעות', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'סיוע במיצוי זכויות ניצולי שואה בסניף טבריה של "הייעוץ לקשיש"',  'org' => 'המוסד לביטוח לאומי', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'סיוע בשיפוץ דירות של ניצולי שואה - "חיים בכבוד"',  'org' => 'הקרן לרווחה לנפגעי השואה בישראל', 'date' => '19.12.2012', 'on_behalf' => 'יניב קומיסיונרו ' ),
			array( 'title' => 'סיוע התנדבותי לניצולי שואה במסגרת תכנית "פרח לניצול"',  'org' => 'הקרן לרווחה לנפגעי השואה בישראל', 'date' => '30.12.2012', 'on_behalf' => 'יניב קומיסיונרו' ),
			array( 'title' => 'סיוע לניצולי שואה בתכתובות עם ממשלת גרמניה',  'org' => 'אביב לניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'סיוע לניצולי שואה יוצאי הונגריה מהקרן לרווחה לנפגעי השואה בישראל',  'org' => 'הקרן לרווחה לנפגעי השואה בישראל', 'date' => '06.03.2013', 'on_behalf' => 'יניב קומיסיונרו' ),
			array( 'title' => 'סיוע לניצולי שואה יוצאי צרפת',  'org' => 'עלומים', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'סיוע נוסף בשכר דירה לניצולי שואה',  'org' => 'משרד השיכון', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'סיעוד לניצולי שואה המקבלים רנטה בריאותית מגרמניה',  'org' => 'הלשכה לענייני פיצויים אישיים מחו"ל', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'קצבה (רנטה) בריאותית לניצולי שואה מממשלת גרמניה (BEG)',  'org' => 'הלשכה לענייני פיצויים אישיים מחו"ל', 'date' => '06.03.2013', 'on_behalf' => 'חנה פלור ' ),
			array( 'title' => 'עזרה סיעודית לניצולי שואה לאחר אשפוז מהקרן לרווחה לנפגעי השואה בישראל',  'org' => 'הקרן לרווחה לנפגעי השואה בישראל', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'עזרה סיעודית לניצולי שואה מהקרן לרווחה לנפגעי השואה בישראל',  'org' => 'הקרן לרווחה לנפגעי השואה בישראל', 'date' => '06.03.2013', 'on_behalf' => 'יניב קומיסיונרו' ),
			array( 'title' => 'עלומים',  'org' => 'עלומים', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'עמותת אלה',  'org' => 'עמותת אלה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'פטור מהוצאות רפואיות לניצולי שואה, במחלות (נכויות) המוכרות בלבד',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'תגמול לניצולי שואה ממשרד האוצר',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '10.02.2013', 'on_behalf' => 'רוית ליברמן ' ),
			array( 'title' => 'תגמול לשאירים של ניצולי שואה שקיבלו תגמול לפי הכנסה/תגמול מוגדל לפי הכנסה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '10.02.2013', 'on_behalf' => 'רוית ליברמן ' ),
			array( 'title' => 'פטור מלא מאגרת טלויזיה',  'org' => 'כל-זכות', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'פיצוי מגרמניה עבור עבודה שלא בכפייה לניצולי שואה',  'org' => 'ועידת התביעות', 'date' => '26.12.2012', 'on_behalf' => 'אודי מוזס ' ),
			array( 'title' => 'פנסיה סוציאלית מגרמניה בגין עבודה בגטאות (ZRBG)',  'org' => 'ועידת התביעות', 'date' => '27.01.2013', 'on_behalf' => 'אודי מוזס' ),
			array( 'title' => 'פרויקט "לעד"',  'org' => 'הסוכנות היהודית - פרויקט לעד', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'פרויקט הרט (HEART)',  'org' => 'הסוכנות היהודית', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'פרשנות המגבלה על שכר טרחת עו"ד בתובענות של ניצולי שואה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'קצבה (רנטה) לניצולי שואה מממשלת צרפת',  'org' => 'כל-זכות', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'קצבה (רנטה) לניצולי שואה ממשרד האוצר',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'קצבה לניצולי שואה אזרחי רומניה',  'org' => 'כל-זכות', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'קצבה לניצולי שואה ממשרד האוצר ליוצאי מחנות וגטאות',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '10.02.2013', 'on_behalf' => 'רוית ליברמן' ),
			array( 'title' => 'קצבה לניצולי שואה מקרן סעיף 2 של ועידת התביעות',  'org' => 'ועידת התביעות', 'date' => '28.11.2012 ', 'on_behalf' => 'אודי מוזס' ),
			array( 'title' => 'קצבה לשאירים של ניצולי שואה זכאים לקצבה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'קצבה לשארים של ניצולים המקבלים רנטה מגרמניה',  'org' => 'הלשכה לענייני פיצויים אישיים מחו"ל', 'date' => '05.12.2012', 'on_behalf' => 'חנה פלור ' ),
			array( 'title' => 'זכויות ריפוי לניצולי שואה המקבלים רנטה בריאותית מגרמניה (BEG)',  'org' => 'הלשכה לענייני פיצויים אישיים מחו"ל', 'date' => '19.12.2012', 'on_behalf' => 'חנה פלור ' ),
			array( 'title' => 'שובר שירותים לניצולי שואה',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '20.01.2013', 'on_behalf' => 'טובה זלצר' ),
			array( 'title' => 'שיקולים להפעלת תקנה 12 לתקנות נכי רדיפת הנאצים (קביעת דרגת נכות)',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '27.02.2013', 'on_behalf' => 'שרה שהם' ),
			array( 'title' => 'סיוע נפשי לניצולי שואה ובני משפחתם מטעם עמותת "עמך"',  'org' => 'עמך', 'date' => '23.12.2012', 'on_behalf' => 'מוניקה דרוקרוף' ),
			array( 'title' => 'מרכזים טיפוליים-שיקומיים לניצולי שואה מטעם עמותת "עמך"',  'org' => 'עמך', 'date' => '23.12.2012', 'on_behalf' => 'מוניקה דרוקרוף' ),
			array( 'title' => 'ביקורי בית לניצולי שואה מטעם מתנדבי עמותת "עמך"',  'org' => 'עמך', 'date' => '23.12.2012', 'on_behalf' => 'מוניקה דרוקרוף' ),
			array( 'title' => 'עמך',  'org' => 'עמך', 'date' => '02.01.2013', 'on_behalf' => 'מוניקה דרוקרוף ' ),
			array( 'title' => 'תיעוד סיפורם האישי של ניצולי שואה באמצעות עמותת "עמך"',  'org' => 'עמך', 'date' => '23.12.2012', 'on_behalf' => 'מוניקה דרוקרוף' ),
			array( 'title' => 'תכלית תקנה 12 לתקנות נכי רדיפות הנאצים (קביעת דרגת נכות) להוסיף אחוזי נכות בשל מצב כללי',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '27.02.2013', 'on_behalf' => 'שרה שהם' ),
			array( 'title' => 'ניצולי שואה - פירוט סוגי התשלום',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '14.11.2012', 'on_behalf' => 'טובה זלצר' ),
			array( 'title' => 'יד ושם',  'org' => 'יד ושם', 'date' => '27.01.2013', 'on_behalf' => 'אורלי ניר' ),
			array( 'title' => 'מילוי דף עד להנצחת קרבנות השואה באתר יד ושם',  'org' => 'יד ושם', 'date' => '27.01.2013', 'on_behalf' => 'אורלי ניר' ),
			array( 'title' => 'רישום ניצולי שואה ביד ושם',  'org' => 'יד ושם', 'date' => '27.01.2013', 'on_behalf' => 'אורלי ניר' ),
			array( 'title' => 'איסוף ותיעוד פריטים מתקופת השואה ביד ושם',  'org' => 'יד ושם', 'date' => '27.01.2013', 'on_behalf' => 'אורלי ניר' ),
			array( 'title' => 'גביית עדות מניצולי שואה',  'org' => 'יד ושם', 'date' => '27.01.2013', 'on_behalf' => 'אורלי ניר' ),
			array( 'title' => 'סמינרים לאנשי עדות - ניצולי שואה ביד ושם',  'org' => 'יד ושם', 'date' => '27.01.2013', 'on_behalf' => 'אורלי ניר' ),
			array( 'title' => 'תקנות נכי רדיפות הנאצים (קביעת דרגת נכות)',  'org' => 'הרשות לזכויות ניצולי השואה', 'date' => '', 'on_behalf' => '' ),
			array( 'title' => 'המשפט בשירות הזיקנה',  'org' => 'המשפט בשירות הזיקנה', 'date' => '10.02.2013', 'on_behalf' => 'כרמית שי' ),
			array( 'title' => 'ייעוץ משפטי בעמותת המשפט בשירות הזיקנה',  'org' => 'המשפט בשירות הזיקנה', 'date' => '10.02.2013', 'on_behalf' => 'כרמית שי' ),
			array( 'title' => 'הגדרת נכה המלחמה בנאצים',  'org' => 'הרשות לזכויות ניצולי השואה}', 'date' => '20.03.2013', 'on_behalf' => 'תמרה פרלמן' ),
			array( 'title' => 'תגמול רגיל לנכה המלחמה בנאצים',  'org' => 'הרשות לזכויות ניצולי השואה}', 'date' => '20.03.2013', 'on_behalf' => 'תמרה פרלמן' ),
			array( 'title' => 'תגמול מוגדל לפי הכנסה לנכה המלחמה בנאצים',  'org' => 'הרשות לזכויות ניצולי השואה}', 'date' => '20.03.2013', 'on_behalf' => 'תמרה פרלמן' ),
		);
		
		$assigning_user = User::newFromName( 'עידית צימרמן' );
		
		$approving_user = User::newFromName( 'מינהלת מיזם ניצולי שואה' );
		// Add to DB if it doesn't exist
		if ( !$approving_user->isLoggedIn() ) {
			$approving_user->addToDatabase();
		}
		
		$holocaustauthoritygroup = 'holocaustauthority';
		$holocaustauthorityname = 'הרשות לזכויות ניצולי השואה';
		$group = 'projectdelegate';
		$reason = 'ייבוא מידע קיים';
		$project = 'מיזם ניצולי שואה';
				
		foreach( $entries as $entry ) {
			$title = Title::newFromText( $entry['title'] );
			
			if( !is_null( $title ) && $title->getArticleID() > 0 ) {
				$on_behalf = $entry['on_behalf'];
				$organization = $entry['org'];
				$approval_date = $entry['date'];
				
				/*
				if( $organization == $holocaustauthorityname ) {
					$group = $holocaustauthoritygroup;
				}
				*/
				
				ApprovedRevs::logProjectAssignment( $title, 'assign', $assigning_user, $project, $organization, $group, $reason );
				ApprovedRevs::saveProjectAssociationInDB( $title, 'assign', $project, $organization, $group);
				$this->output( wfTimestamp( TS_DB ) . ' Assigned page "' . $title->getFullText() . '" to project.' . "\n" );
				
				if( !empty( $approval_date ) && !empty( $on_behalf ) ) {
					$comments = 'ייבוא נתונים ראשוני. במקור אושר בתאריך ' . $approval_date;
					ApprovedRevs::logPageApproval( $title, $approving_user, $on_behalf, $comments );
					ApprovedRevs::savePageApprovalInDB( $title, $approving_user, $on_behalf, $comments );
					$this->output( wfTimestamp( TS_DB ) . ' Approved the latest revision of page "' . $title->getFullText() . '".' . "\n" );
				}
			}
			
			else {
				throw new MWException( "{$entry['title']} doesn't exist!\n" );
			}
		}
		
		$this->output( "\nFinished assigning and approving pages. \n" );
	}
}

$maintClass = "ApproveAllPages";
require_once( DO_MAINTENANCE );
